`include "risc-v.svh"


/*
 * Module `imm_gen`
 *
 *   Signal-immediate generator
 *
 *   Inputs:
 *     - Imm_in:    logic[24:0]  Instruction (without opcode) (imm_inp = instr[31:7])
 *     - imm_type: logic[2:0]   Immediate type: (0) - Not immediate, (1) - I-type, (2) - S-type, (3) - B-type,
 *                                                                   (4) - U-type, (5) - J-type
 *   Outputs:
 *     - imm:      logic[31:0]  The generated immediate.
 */
/*
 *       24               18 17     13 12      8 7       5 4           0
 *      ┌─────────────────────────────┬─────────┬─────────┬─────────────┐
 *   I  │           imm[11:0]         │ rs1     │ funct3  │    rd       │  I (1)
 *      ├───────────────────┬─────────┼─────────┼─────────┼─────────────┤
 *   S  │      imm[11:5]    │ rs2     │ rs1     │ funct3  │  imm[4:0]   │  S (2)
 *      ├────┬──────────────┼─────────┼─────────┼─────────┼────────┬────┤
 *   B  │[12]│   imm[10:5]  │ rs2     │ rs1     │ funct3  │imm[4:1]│[11]│  B (3)
 *      ├────┴──────────────┴─────────┴─────────┴─────────┼────────┴────┤
 *   U  │                 imm[31:12]                      │    rd       │  U (4)
 *      ├────┬───────────────────┬────┬───────────────────┼─────────────┤
 *   J  │[20]|       imm[10:1]   │[11]│     imm[19:12]    │    rd       │  J (5)
 *      └────┴───────────────────┴────┴───────────────────┴────────┴────┘
 *       24   23               14  13  12                5 4      1   0
 */
module imm_gen import risc_v_pkg::*;
(
    input  Imm_input_t  Imm_in,
    input  Imm_type_t   imm_type,
    output Imm_t        imm
);


    always_comb begin
        case (imm_type)
            IMM_I_TYPE: imm = {{20{Imm_in[24]}}, Imm_in[24:13]};                                               // I-type
            IMM_S_TYPE: imm = {{20{Imm_in[24]}}, Imm_in[24:18], Imm_in[4:0]};                                  // S-type
            IMM_B_TYPE: imm = {{19{Imm_in[24]}}, Imm_in[24], Imm_in[0], Imm_in[23:18], Imm_in[4:2], 2'b00};    // B-type
            IMM_U_TYPE: imm = {Imm_in[24:5], 12'b0};                                                           // U-type
            IMM_J_TYPE: imm = {{11{Imm_in[24]}}, Imm_in[24], Imm_in[12:5], Imm_in[13], Imm_in[23:15], 2'b00};  // J-type

            // In B and J type fill the last 2 bits with zeros.

            default:    imm = 32'b0;
        endcase
    end
    
endmodule : imm_gen